In [9]:
import pandas as pd
import numpy as np

In [102]:
# DataFrame with duplicates
books = pd.DataFrame({
    "title": ["1984", "Dune", "Dune", "Hamlet", "Hamlet", "Hamlet", "Emma"],
    "author": ["Orwell", "Herbert", "Herbert", "Shakespeare", "Shakespeare", "Shakespeare", "Austen"],
    "year": [1949, 1965, 1965, 1603, 1603, 1609, 1815]
})

# DataFrame with missing values
students = pd.DataFrame({
    "first_name": ["Liam", np.nan, "Noah", "Emma", "Olivia"],
    "last_name": ["Smith", np.nan, "Johnson", "Brown", "Wilson"],
    "age": [20, np.nan, 22, 19, 21],
    "major": ["Math", np.nan, "CS", "History", "Biology"],
    "gpa": [3.5, np.nan, np.nan, 3.7, 3.9],
    "credits": [30, np.nan, np.nan, 25, 40]
})

# Customers and orders for merging
customers = pd.DataFrame({
    "cust_id": [1, 2, 3, 4],
    "name": ["Alice", "Bob", "Clara", "David"]
})

orders = pd.DataFrame({
    "order_id": [101, 102, 103, 104],
    "cust_id": [1, 2, 2, 5],
    "amount": [250, 400, 150, 500]
})

display(books)
display(students)
display(customers)
display(orders)

    title       author  year
0    1984       Orwell  1949
1    Dune      Herbert  1965
2    Dune      Herbert  1965
3  Hamlet  Shakespeare  1603
4  Hamlet  Shakespeare  1603
5  Hamlet  Shakespeare  1609
6    Emma       Austen  1815

  first_name last_name   age    major  gpa  credits
0       Liam     Smith  20.0     Math  3.5     30.0
1        NaN       NaN   NaN      NaN  NaN      NaN
2       Noah   Johnson  22.0       CS  NaN      NaN
3       Emma     Brown  19.0  History  3.7     25.0
4     Olivia    Wilson  21.0  Biology  3.9     40.0

   cust_id   name
0        1  Alice
1        2    Bob
2        3  Clara
3        4  David

   order_id  cust_id  amount
0       101        1     250
1       102        2     400
2       103        2     150
3       104        5     500

In [11]:
display(df.duplicated())

0    False
1    False
2     True
3    False
4     True
5    False
6    False
dtype: bool

In [23]:
#1.2
print(df[df.duplicated()])

   id   name  score
2   2    Bob     85
5   4  David     80

In [36]:
#1.3
books.drop_duplicates(subset=['title'], keep='last')

    title       author  year
0    1984       Orwell  1949
2    Dune      Herbert  1965
5  Hamlet  Shakespeare  1609
6    Emma       Austen  1815

In [37]:
#1.4
books['author'].duplicated().sum()

np.int64(3)

In [47]:
#2.1
students.isna().sum()

first_name       1
last_name        1
age              1
major            1
gpa              2
credits          2
missing_count    0
dtype: int64

In [55]:
#2.2
missing_count = students['missing_count'] = students.isna().sum(axis=1)
print(missing_count)

0    0
1    6
2    2
3    0
4    0
dtype: int64

In [56]:
#2.3
students[students['gpa'].isna() & students['first_name'].notna()]

  first_name last_name   age major  gpa  credits  missing_count
2       Noah   Johnson  22.0    CS  NaN      NaN              2

In [86]:
#2.4
students.isna().sum().idxmax()

'gpa'

In [103]:
#3.1
mean_age = students['age'].mean()
students_age_filled = students.copy()
students_age_filled['age'] = students['age'].fillna(mean_age)

print(students_age_filled)

  first_name last_name   age    major  gpa  credits
0       Liam     Smith  20.0     Math  3.5     30.0
1        NaN       NaN  20.5      NaN  NaN      NaN
2       Noah   Johnson  22.0       CS  NaN      NaN
3       Emma     Brown  19.0  History  3.7     25.0
4     Olivia    Wilson  21.0  Biology  3.9     40.0

In [106]:
#3.2
min_gpa = students['gpa'].min()
students_gpa_filled = students.copy()
students_gpa_filled['gpa'] = students['gpa'].fillna(min_gpa)

print(students_gpa_filled)

  first_name last_name   age    major  gpa  credits
0       Liam     Smith  20.0     Math  3.5     30.0
1        NaN       NaN   NaN      NaN  3.5      NaN
2       Noah   Johnson  22.0       CS  3.5      NaN
3       Emma     Brown  19.0  History  3.7     25.0
4     Olivia    Wilson  21.0  Biology  3.9     40.0

In [108]:
#3.3
max_credits = students['credits'].max()
students_credits_filled = students.copy()
students_credits_filled['credits'] = students['credits'].fillna(max_credits)

print(students_credits_filled)

  first_name last_name   age    major  gpa  credits
0       Liam     Smith  20.0     Math  3.5     30.0
1        NaN       NaN   NaN      NaN  NaN     40.0
2       Noah   Johnson  22.0       CS  NaN     40.0
3       Emma     Brown  19.0  History  3.7     25.0
4     Olivia    Wilson  21.0  Biology  3.9     40.0

In [110]:
#3.4
The age using the mean is realistic

<class 'SyntaxError'>: invalid syntax (<ipython-input-110-dd61180d24b5>, line 2)

In [114]:
#4.1 Drop all rows that contain any NaN values
drop_na_rows = students_no_nan = students.dropna()
print(drop_na_rows)

  first_name last_name   age    major  gpa  credits
0       Liam     Smith  20.0     Math  3.5     30.0
3       Emma     Brown  19.0  History  3.7     25.0
4     Olivia    Wilson  21.0  Biology  3.9     40.0

In [117]:
#4.2
students_not_all_nan = students.dropna(how='all')
print(students_not_all_nan)

  first_name last_name   age    major  gpa  credits
0       Liam     Smith  20.0     Math  3.5     30.0
2       Noah   Johnson  22.0       CS  NaN      NaN
3       Emma     Brown  19.0  History  3.7     25.0
4     Olivia    Wilson  21.0  Biology  3.9     40.0

In [122]:
#4.3
students_thresh3 = students.dropna(thresh=3)
print(students_thresh3)

  first_name last_name   age    major  gpa  credits
0       Liam     Smith  20.0     Math  3.5     30.0
2       Noah   Johnson  22.0       CS  NaN      NaN
3       Emma     Brown  19.0  History  3.7     25.0
4     Olivia    Wilson  21.0  Biology  3.9     40.0

In [124]:
#4.3
threshold = len(students) * 0.5
students_fewer_missing_cols = students.dropna(axis=1, thresh=threshold)
print(students_fewer_missing_cols)

  first_name last_name   age    major  gpa  credits
0       Liam     Smith  20.0     Math  3.5     30.0
1        NaN       NaN   NaN      NaN  NaN      NaN
2       Noah   Johnson  22.0       CS  NaN      NaN
3       Emma     Brown  19.0  History  3.7     25.0
4     Olivia    Wilson  21.0  Biology  3.9     40.0